podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_STM32F030.svd.xml
            <register derivedFrom="CCR1"> <name>CCR2</name> <addressOffset>0x1C</addressOffset> </register>
            <register>
               <name>CNDTR2</name>
               <description>DMA channel 2 number of data
          register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR2</name>
               <description>DMA channel 2 peripheral address
          register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR2</name>
               <description>DMA channel 2 memory address
          register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="CCR1"> <name>CCR3</name> <addressOffset>0x30</addressOffset> </register>
            <register>
               <name>CNDTR3</name>
               <description>DMA channel 3 number of data
          register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR3</name>
               <description>DMA channel 3 peripheral address
          register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR3</name>
               <description>DMA channel 3 memory address
          register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="CCR1"> <name>CCR4</name> <addressOffset>0x44</addressOffset> </register>
            <register>
               <name>CNDTR4</name>
               <description>DMA channel 4 number of data
          register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR4</name>
               <description>DMA channel 4 peripheral address
          register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR4</name>
               <description>DMA channel 4 memory address
          register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="CCR1"> <name>CCR5</name> <addressOffset>0x58</addressOffset> </register>
            <register>
               <name>CNDTR5</name>
               <description>DMA channel 5 number of data
          register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR5</name>
               <description>DMA channel 5 peripheral address
          register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR5</name>
               <description>DMA channel 5 memory address
          register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
