podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_STM32F030.svd.xml
            <register derivedFrom="CCR1"> <name>CCR6</name> <addressOffset>0x6C</addressOffset> </register>
            <register>
               <name>CNDTR6</name>
               <description>DMA channel 6 number of data
          register</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR6</name>
               <description>DMA channel 6 peripheral address
          register</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR6</name>
               <description>DMA channel 6 memory address
          register</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="CCR1"> <name>CCR7</name> <addressOffset>0x80</addressOffset> </register>
            <register>
               <name>CNDTR7</name>
               <description>DMA channel 7 number of data
          register</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data to transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR7</name>
               <description>DMA channel 7 peripheral address
          register</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR7</name>
               <description>DMA channel 7 memory address
          register</description>
               <addressOffset>0x8C</addressOffset>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
